# filters.py
import re

KEYWORDS = ["개발컨설팅", "기술협력", "개발지원", "국제농업협력", "국제협력", "개발도상국", "개도국", "국제개발", "개발협력", "ODA", "아시아", "아프리카", "중남미", "유라시아", "중동", "중앙아시아", "가나", "가봉", "가이아나", "감비아", "과테말라", "그레나다", "기니", "기니비사우", "나미비아", "나이지리아", "남수단", "남아프리카공화국", "네팔", "니제르", "니카라과", "도미니카공화국", "동티모르", "라오스", "라이베리아", "레바논", "레소토", "르완다", "리비아", "마다가스카르", "마셜제도", "말라위", "말레이시아", "말리", "멕시코", "모로코", "모리셔스", "모리타니아", "모잠비크", "몬테네그로", "몰도바", "몰디브", "몽골", "미얀마", "바누아투", "방글라데시", "베냉", "베네수엘라", "베트남", "벨라루스", "벨리즈", "보스니아헤르체고비나", "보츠와나", "볼리비아", "부룬디", "부르키나파소", "부탄", "북마케도니아", "브라질", "사모아", "상투메프린시페", "세네갈", "세르비아", "세인트루시아", "소말리아", "솔로몬제도", "수단", "수리남", "스리랑카", "시리아", "시에라리온", "아르메니아", "아르헨티나", "아이티", "아제르바이잔", "아프가니스탄", "알바니아", "알제리", "앙골라", "에리트레아", "에스와티니", "에콰도르", "에티오피아", "엘살바도르", "예멘", "온두라스", "요르단", "우간다", "우즈베키스탄", "우크라이나", "이라크", "이란", "이집트", "인도", "인도네시아", "자메이카", "잠비아", "적도기니", "조지아", "중국", "중앙아프리카공화국", "지부티", "짐바브웨", "차드", "카메룬", "카보베르데", "카자흐스탄", "캄보디아", "케냐", "코모로", "코소보", "코스타리카", "코트디부아르", "콜롬비아", "콩고공화국", "콩고민주공화국(DR콩고)", "쿠바", "키르기스스탄", "키리바시", "타지키스탄", "탄자니아", "태국", "토고", "통가", "투르크메니스탄", "투발루", "튀니지", "튀르키예", "파나마", "파라과이", "파키스탄", "파푸아뉴기니", "팔라우", "페루", "피지", "필리핀", "DR콩고"]

_PATTERN = re.compile("|".join(map(re.escape, KEYWORDS)))

def keyword_match(text: str) -> bool:
    if not text:
        return False
    return _PATTERN.search(text) is not None